package curriculum_A;

public class Qes1_13 {

	public static void main(String[] args) {

		//Q1.下記9個をローカル変数として宣言

		//バイト型・短整数型・整数型・長整数型の宣言
		byte by;
		short sh;
		int in;
		long lo;

		//単精度浮動小数点数型・倍精度浮動小数点数型
		float fl;
		double db;

		//文字型・文字列型
		char ch;
		String st;

		//ブーリアン型
		boolean bl;

		//==================================================================================================================

		//Q2.それぞれのローカル変数をローカル内でそれぞれの初期値を代入し初期化

		//バイト型・短整数型・整数型・長整数型
		by = 0;
		sh = 0;
		in = 0;
		lo = 0L;

		//単精度浮動小数点数型・倍精度浮動小数点数型
		fl = 0.0f;
		db = 0.0d;

		//文字型・文字列型
		ch = '\u0000';
		st = null;

		//ブーリアン型
		bl = false;

		//==================================================================================================================

		//Q3.初期化をしたそれぞれの変数に下記の値を代入

		//バイト型に 10 を代入
		by = 10;

		//短整数型に 100 を代入
		sh = 100;

		//整数型に 1000 を代入
		in = 1000;

		//長整数型に 10000 を代入
		lo = 10000L;

		//単精度浮動小数点数型に 9.5 を代入
		fl = 9.5f;

		//倍精度浮動小数点数型に 10.5 を代入
		db = 10.5d;

		//文字型に a を代入
		ch = 'a';

		//文字列型に ハロー を代入
		st = "ハロー";

		//ブーリアン型に true を代入
		bl = true;

		//==================================================================================================================

		//Q4.上記で作成した変数を使用して下記の通りにコンソール出力

		// 11110 を出力
		System.out.println(by + sh + in + lo);

		// 20 を出力
		System.out.println(fl + db);

		// 「a ハロー true」を出力
		System.out.println(ch + " " + st + " " + bl);

		//数字を全て足して 11130 を出力
		System.out.println(by + sh + in + lo + fl + db);

		//小数点以外の数字を全てかけて 10000000000 を出力
		System.out.println(by * sh * in * lo);

		//10.5割る100をして 0.105 を出力
		System.out.println(fl / sh);

		//10引く100をして -90 を出力
		System.out.println(by - sh);

		//==================================================================================================================

		/*
		 * Q5.下記プログラムを「ハローJAVA43」と表示されるように修正
		 * String num="20";
		 * int num1=23;
		 * System.out.println("ハローJAVA"+(num+num1));
		 */
		int num = 20;
		int num1 = 23;
		System.out.println("ハローJAVA" + (num + num1));

		//==================================================================================================================

		/*
		 * Q6.『山田太郎 18歳 170.5cm 62.2kg 寿司』の情報を変数にして、formatの通りコンソールに出力
		 *↓↓format↓↓
		 *「初めまして○○です」
		 *「年齢は○○歳です」
		 *「身長は○○cmです」
		 *「体重は○○kgです」
		 *「好きな食べ物は○○です」
		 */

		//『山田太郎』をローカル変数に代入
		String name = "山田太郎";

		//『18』をローカル変数に代入
		int age = 18;

		//『170.5』をローカル変数に代入
		double height = 170.5;

		//『62.2』をローカル変数に代入
		double weight = 62.2;

		//『寿司』をローカル変数に代入
		String favoriteFood = "寿司";

		//「初めまして山田太郎です」と出力
		System.out.println("初めまして" + name + "です");

		//「年齢は18歳です」と出力
		System.out.println("年齢は" + age + "歳です");

		//「身長は170.5cmです」と出力
		System.out.println("身長は" + height + "cmです");

		//「体重は62.2kgです」と出力
		System.out.println("体重は" + weight + "kgです");

		//「好きな食べ物は寿司です」と出力
		System.out.println("好きな食べ物は" + favoriteFood + "です");

		//==================================================================================================================

		/*
		 * Q7.『Q6』で作成した自己紹介に続いて、「BMIは○○です」の形式でBMIを出力
		 * BMI ＝ 体重kg ÷ (身長m)^2
		 */

		//身長をcmからmに変換
		double height2 = height / sh;

		//「BMIは○○です」の形式でBMIを出力
		/*
		 * roundメソッドは小数点第一位で四捨五入するため、BMIに10をかけた値を四捨五入した後10で割ることで、小数点数第一位まで表示
		 * 最終的にdouble型の計算結果を得たいが、このままでは整数値で表示されるため、double型にキャスト
		 */
		System.out.println("BMIは" + (double) (Math.round(by * weight / (height2 * height2))) / 10 + "です");

		//==================================================================================================================

		/*
		 * Q8.『Q6』で宣言した変数に再代入し下記の通りコンソールに出力
		 * 「初めまして鈴木一郎です」
		 * 「年齢は24歳です」
		 * 「身長168.5cmです」
		 * 「体重は64.2kgです」
		 * 「好きな食べ物はオムライスです」
		 * 「BMIは22.6です」
		 */

		//変数nameに 鈴木一郎 を再代入
		name = "鈴木一郎";

		//変数ageに 24 を再代入
		age = 24;

		//変数heightに 168.5 を再代入
		height = 168.5;

		//変数weightに 64.2 を再代入
		weight = 64.2;

		//変数favoriteFoodに オムライス を再代入
		favoriteFood = "オムライス";

		//「初めまして鈴木一郎です」と出力
		System.out.println("初めまして" + name + "です");

		//「年齢は24歳です」
		System.out.println("年齢は" + age + "歳です");

		//「身長168.5cmです」
		System.out.println("身長は" + height + "cmです");

		//「体重は64.2kgです」
		System.out.println("体重は" + weight + "kgです");

		// 「好きな食べ物はオムライスです」
		System.out.println("好きな食べ物は" + favoriteFood + "です");

		// 「BMIは22.6です」
		height2 = height / sh;
		System.out.println("BMIは" + (double) (Math.round(by * weight / (height2 * height2))) / 10 + "です");

		//==================================================================================================================

		/*
		 * Q9.「Q8」で使用した変数【年齢・身長・体重】の数値を和算で自己代入し、下記の通りコンソールに出力
		 * 初めまして鈴木一郎です
		 * 年齢は48歳です
		 * 身長337.0cmです
		 * 体重は128.4kgです
		 * 好きな食べ物はオムライスです
		 * BMIは11.31です
		 */

		//変数ageの数値を和算で自己代入
		age += age;

		//変数heightの数値を和算で自己代入
		height += height;

		//変数weightの数値を和算で自己代入
		weight += weight;

		//「初めまして鈴木一郎です」と出力
		System.out.println("初めまして" + name + "です");

		//「年齢は48歳です」
		System.out.println("年齢は" + age + "歳です");

		//「身長337.0cmです」
		System.out.println("身長は" + height + "cmです");

		//「体重は128.4kgです」
		System.out.println("体重は" + weight + "kgです");

		// 「好きな食べ物はオムライスです」
		System.out.println("好きな食べ物は" + favoriteFood + "です");

		// 「BMIは11.3です」
		height2 = height / sh;
		System.out.println("BMIは" + (double) (Math.round(by * weight / (height2 * height2))) / 10 + "です");

		//==================================================================================================================

		/*
		 * Q10.「Q8」で使用した年齢が25歳以上ならtrueを出力。
		 * ただしif文は使用不可
		 */

		//変数ageに「Q8」で使用した年齢 24 を再代入
		age = 24;

		//「Q8」で使用した年齢が25歳以上ならtrueを出力
		//「Q8」で使用した年齢は 24 のため、今回はfalseが出力される
		System.out.println(age >= 25);

		//==================================================================================================================

		//Q11.「Q8」で使用した【年齢・身長・体重】を文字列型に型変換し繋げて出力

		//変数heightに「Q8」で使用した身長 168.5 を再代入
		height = 168.5;

		//変数weightに「Q8」で使用した体重 64.2 を再代入
		weight = 64.2;

		//変数ageを文字列型に型変換
		String stAge = String.valueOf(age);

		//変数heightを文字列型に型変換
		String stHeight = String.valueOf(height);

		//変数weightを文字列型に型変換
		String stWeight = String.valueOf(weight);

		//上記【年齢・身長・体重】を繋げて出力
		System.out.println(stAge + stHeight + stWeight);

		//==================================================================================================================

		//Q12.「Q11」で変換した【年齢・身長】を整数型に変換して出力

		//変数stAgeを整数型に変換
		int intAge = Integer.valueOf(stAge);

		//変数stHeightを整数型に変換
		int intHeight = (int) Double.parseDouble(stHeight);

		//年齢を出力
		System.out.println(intAge);

		//身長を出力
		System.out.println(intHeight);

		//==================================================================================================================

		/*
		 * Q13.「Q12」で変換した【年齢・身長】で【年齢が25もしくは身長が160以上】であればtrueを出力
		 * ただしif文は使用不可
		 */
		System.out.println(intAge == 25 || intHeight >= 160);

	}

}
